zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam0/include/same51/instance/evsys.h
#define REG_EVSYS_USER53           (*(RwReg  *)0x4100E1F4UL) /**< \brief (EVSYS) User Multiplexer 53 */
#define REG_EVSYS_USER54           (*(RwReg  *)0x4100E1F8UL) /**< \brief (EVSYS) User Multiplexer 54 */
#define REG_EVSYS_USER55           (*(RwReg  *)0x4100E1FCUL) /**< \brief (EVSYS) User Multiplexer 55 */
#define REG_EVSYS_USER56           (*(RwReg  *)0x4100E200UL) /**< \brief (EVSYS) User Multiplexer 56 */
#define REG_EVSYS_USER57           (*(RwReg  *)0x4100E204UL) /**< \brief (EVSYS) User Multiplexer 57 */
#define REG_EVSYS_USER58           (*(RwReg  *)0x4100E208UL) /**< \brief (EVSYS) User Multiplexer 58 */
#define REG_EVSYS_USER59           (*(RwReg  *)0x4100E20CUL) /**< \brief (EVSYS) User Multiplexer 59 */
#define REG_EVSYS_USER60           (*(RwReg  *)0x4100E210UL) /**< \brief (EVSYS) User Multiplexer 60 */
#define REG_EVSYS_USER61           (*(RwReg  *)0x4100E214UL) /**< \brief (EVSYS) User Multiplexer 61 */
#define REG_EVSYS_USER62           (*(RwReg  *)0x4100E218UL) /**< \brief (EVSYS) User Multiplexer 62 */
#define REG_EVSYS_USER63           (*(RwReg  *)0x4100E21CUL) /**< \brief (EVSYS) User Multiplexer 63 */
#define REG_EVSYS_USER64           (*(RwReg  *)0x4100E220UL) /**< \brief (EVSYS) User Multiplexer 64 */
#define REG_EVSYS_USER65           (*(RwReg  *)0x4100E224UL) /**< \brief (EVSYS) User Multiplexer 65 */
#define REG_EVSYS_USER66           (*(RwReg  *)0x4100E228UL) /**< \brief (EVSYS) User Multiplexer 66 */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ========== Instance parameters for EVSYS peripheral ========== */
#define EVSYS_ASYNCHRONOUS_CHANNELS 0xFFFFF000 // Mask of Only Asynchronous Channels
#define EVSYS_CHANNELS              32       // Total Number of Channels
#define EVSYS_CHANNELS_BITS         5        // Number of bits to select Channel
#define EVSYS_EXTEVT_NUM            0        // Number of External Event Generators
#define EVSYS_GCLK_ID_0             11
#define EVSYS_GCLK_ID_1             12
#define EVSYS_GCLK_ID_2             13
#define EVSYS_GCLK_ID_3             14
#define EVSYS_GCLK_ID_4             15
#define EVSYS_GCLK_ID_5             16
#define EVSYS_GCLK_ID_6             17
#define EVSYS_GCLK_ID_7             18
#define EVSYS_GCLK_ID_8             19
#define EVSYS_GCLK_ID_9             20
#define EVSYS_GCLK_ID_10            21
#define EVSYS_GCLK_ID_11            22
#define EVSYS_GCLK_ID_LSB           11
#define EVSYS_GCLK_ID_MSB           22
#define EVSYS_GCLK_ID_SIZE          12
#define EVSYS_GENERATORS            119      // Total Number of Event Generators
#define EVSYS_GENERATORS_BITS       7        // Number of bits to select Event Generator
#define EVSYS_SYNCH_NUM             12       // Number of Synchronous Channels
#define EVSYS_SYNCH_NUM_BITS        4        // Number of bits to select Synchronous Channels
#define EVSYS_USERS                 67       // Total Number of Event Users
#define EVSYS_USERS_BITS            7        // Number of bits to select Event User

// GENERATORS
#define EVSYS_ID_GEN_OSCCTRL_XOSC_FAIL_0 1
#define EVSYS_ID_GEN_OSCCTRL_XOSC_FAIL_1 2
#define EVSYS_ID_GEN_OSC32KCTRL_XOSC32K_FAIL 3
#define EVSYS_ID_GEN_RTC_PER_0      4
#define EVSYS_ID_GEN_RTC_PER_1      5
#define EVSYS_ID_GEN_RTC_PER_2      6
#define EVSYS_ID_GEN_RTC_PER_3      7
#define EVSYS_ID_GEN_RTC_PER_4      8
#define EVSYS_ID_GEN_RTC_PER_5      9
#define EVSYS_ID_GEN_RTC_PER_6      10
#define EVSYS_ID_GEN_RTC_PER_7      11
#define EVSYS_ID_GEN_RTC_CMP_0      12
#define EVSYS_ID_GEN_RTC_CMP_1      13
#define EVSYS_ID_GEN_RTC_CMP_2      14
#define EVSYS_ID_GEN_RTC_CMP_3      15
#define EVSYS_ID_GEN_RTC_TAMPER     16
#define EVSYS_ID_GEN_RTC_OVF        17
#define EVSYS_ID_GEN_EIC_EXTINT_0   18
#define EVSYS_ID_GEN_EIC_EXTINT_1   19
#define EVSYS_ID_GEN_EIC_EXTINT_2   20
#define EVSYS_ID_GEN_EIC_EXTINT_3   21
#define EVSYS_ID_GEN_EIC_EXTINT_4   22
#define EVSYS_ID_GEN_EIC_EXTINT_5   23
#define EVSYS_ID_GEN_EIC_EXTINT_6   24
#define EVSYS_ID_GEN_EIC_EXTINT_7   25
#define EVSYS_ID_GEN_EIC_EXTINT_8   26
#define EVSYS_ID_GEN_EIC_EXTINT_9   27
#define EVSYS_ID_GEN_EIC_EXTINT_10  28
#define EVSYS_ID_GEN_EIC_EXTINT_11  29
#define EVSYS_ID_GEN_EIC_EXTINT_12  30
#define EVSYS_ID_GEN_EIC_EXTINT_13  31
#define EVSYS_ID_GEN_EIC_EXTINT_14  32
#define EVSYS_ID_GEN_EIC_EXTINT_15  33
#define EVSYS_ID_GEN_DMAC_CH_0      34
#define EVSYS_ID_GEN_DMAC_CH_1      35
#define EVSYS_ID_GEN_DMAC_CH_2      36
#define EVSYS_ID_GEN_DMAC_CH_3      37
#define EVSYS_ID_GEN_PAC_ACCERR     38
#define EVSYS_ID_GEN_TCC0_OVF       41
#define EVSYS_ID_GEN_TCC0_TRG       42
#define EVSYS_ID_GEN_TCC0_CNT       43
#define EVSYS_ID_GEN_TCC0_MC_0      44
#define EVSYS_ID_GEN_TCC0_MC_1      45
#define EVSYS_ID_GEN_TCC0_MC_2      46
#define EVSYS_ID_GEN_TCC0_MC_3      47
#define EVSYS_ID_GEN_TCC0_MC_4      48
#define EVSYS_ID_GEN_TCC0_MC_5      49
#define EVSYS_ID_GEN_TCC1_OVF       50
#define EVSYS_ID_GEN_TCC1_TRG       51
#define EVSYS_ID_GEN_TCC1_CNT       52
#define EVSYS_ID_GEN_TCC1_MC_0      53
#define EVSYS_ID_GEN_TCC1_MC_1      54
#define EVSYS_ID_GEN_TCC1_MC_2      55
#define EVSYS_ID_GEN_TCC1_MC_3      56
#define EVSYS_ID_GEN_TCC2_OVF       57
#define EVSYS_ID_GEN_TCC2_TRG       58
#define EVSYS_ID_GEN_TCC2_CNT       59
#define EVSYS_ID_GEN_TCC2_MC_0      60
#define EVSYS_ID_GEN_TCC2_MC_1      61
#define EVSYS_ID_GEN_TCC2_MC_2      62
#define EVSYS_ID_GEN_TCC3_OVF       63
#define EVSYS_ID_GEN_TCC3_TRG       64
#define EVSYS_ID_GEN_TCC3_CNT       65
#define EVSYS_ID_GEN_TCC3_MC_0      66
#define EVSYS_ID_GEN_TCC3_MC_1      67
#define EVSYS_ID_GEN_TCC4_OVF       68
#define EVSYS_ID_GEN_TCC4_TRG       69
#define EVSYS_ID_GEN_TCC4_CNT       70
#define EVSYS_ID_GEN_TCC4_MC_0      71
#define EVSYS_ID_GEN_TCC4_MC_1      72
#define EVSYS_ID_GEN_TC0_OVF        73
#define EVSYS_ID_GEN_TC0_MC_0       74
#define EVSYS_ID_GEN_TC0_MC_1       75
#define EVSYS_ID_GEN_TC1_OVF        76
#define EVSYS_ID_GEN_TC1_MC_0       77
#define EVSYS_ID_GEN_TC1_MC_1       78
#define EVSYS_ID_GEN_TC2_OVF        79
#define EVSYS_ID_GEN_TC2_MC_0       80
#define EVSYS_ID_GEN_TC2_MC_1       81
#define EVSYS_ID_GEN_TC3_OVF        82
#define EVSYS_ID_GEN_TC3_MC_0       83
#define EVSYS_ID_GEN_TC3_MC_1       84
#define EVSYS_ID_GEN_TC4_OVF        85
#define EVSYS_ID_GEN_TC4_MC_0       86
#define EVSYS_ID_GEN_TC4_MC_1       87
#define EVSYS_ID_GEN_TC5_OVF        88
#define EVSYS_ID_GEN_TC5_MC_0       89
#define EVSYS_ID_GEN_TC5_MC_1       90
#define EVSYS_ID_GEN_TC6_OVF        91
#define EVSYS_ID_GEN_TC6_MC_0       92
#define EVSYS_ID_GEN_TC6_MC_1       93
#define EVSYS_ID_GEN_TC7_OVF        94
#define EVSYS_ID_GEN_TC7_MC_0       95
#define EVSYS_ID_GEN_TC7_MC_1       96
#define EVSYS_ID_GEN_PDEC_OVF       97
#define EVSYS_ID_GEN_PDEC_ERR       98
#define EVSYS_ID_GEN_PDEC_DIR       99
#define EVSYS_ID_GEN_PDEC_VLC       100
#define EVSYS_ID_GEN_PDEC_MC_0      101
#define EVSYS_ID_GEN_PDEC_MC_1      102
#define EVSYS_ID_GEN_ADC0_RESRDY    103
#define EVSYS_ID_GEN_ADC0_WINMON    104
#define EVSYS_ID_GEN_ADC1_RESRDY    105
#define EVSYS_ID_GEN_ADC1_WINMON    106
#define EVSYS_ID_GEN_AC_COMP_0      107
#define EVSYS_ID_GEN_AC_COMP_1      108
#define EVSYS_ID_GEN_AC_WIN_0       109
#define EVSYS_ID_GEN_DAC_EMPTY_0    110
#define EVSYS_ID_GEN_DAC_EMPTY_1    111
#define EVSYS_ID_GEN_DAC_RESRDY_0   112
#define EVSYS_ID_GEN_DAC_RESRDY_1   113
#define EVSYS_ID_GEN_TRNG_READY     115
#define EVSYS_ID_GEN_CCL_LUTOUT_0   116
#define EVSYS_ID_GEN_CCL_LUTOUT_1   117
#define EVSYS_ID_GEN_CCL_LUTOUT_2   118
#define EVSYS_ID_GEN_CCL_LUTOUT_3   119

